app/views/ideas/index.html.erb

		</form>
		<div class="col-md-6"><a href="/ideas/<%=i.id%>"><%=i.users_liked.count%> people </a> like this!</div>
---
SELECT COUNT(*) FROM "users" INNER JOIN "likes" ON "users"."id" = "likes"."user_id" WHERE "likes"."idea_id" = $1  [["idea_id", 1]]