app/views/ideas/show.html.erb

		<th>Name </th>
	<% if @idea.users_liked.count > 0 %>
---
SELECT "users".* FROM "users" INNER JOIN "likes" ON "users"."id" = "likes"."user_id" WHERE "likes"."idea_id" = $1  [["idea_id", 1]]
SELECT COUNT(*) FROM "users" INNER JOIN "likes" ON "users"."id" = "likes"."user_id" WHERE "likes"."idea_id" = $1  [["idea_id", 1]]