app/views/users/show.html.erb

SELECT COUNT(*) FROM "ideas" INNER JOIN "likes" ON "ideas"."id" = "likes"."idea_id" WHERE "likes"."user_id" = $1  [["user_id", 1]]
---

<h3>Total Number of Posts: <%= @user.ideas.count %> </h3>